package lang

type Record struct {
	Name    string
	Comment string // also link if code = -1
	Cyr     string
	Lat     string
	Code    int
}

var (
	byTotal   map[string]*Record
	byName    map[string]*Record
	byNameExt map[string]*Record
	byCyr     map[string]*Record
	byLat     map[string]*Record
	byCode    map[string]*Record
)

func ByName(s string) *Record {
	if byName == nil {
		byName = map[string]*Record{}
		for i := range table {
			if table[i].Code >= 0 {
				byName[table[i].Name] = &table[i]
			}
		}
		for i := range table {
			if table[i].Code < 0 {
				if rec, ok := byName[table[i].Comment]; ok {
					byName[table[i].Name] = rec
				}
			}
		}
	}
	return byName[s]
}

func ByLat(s string) *Record {
	if byLat == nil {
		byLat = map[string]*Record{}
		for i := range table {
			if table[i].Code >= 0 {
				byLat[table[i].Lat] = &table[i]
			}
		}
	}
	return byLat[s]
}

var table = []Record{
	{"Абазинский", "", "аба", "aba", 5},
	{"Абхазский", "", "абх", "abk", 10},
	{"Авадхи", "", "авд", "awa", 12},
	{"Аварский", "", "ава", "ava", 14},
	{"Авестийский", "", "аве", "ave", 16},
	{"Австронезийские", "другие", "авс", "map", 17},
	{"Адангме", "", "ада", "ada", 18},
	{"Адыгейский", "", "ады", "ady", 20},
	{"Азербайджанский", "", "азе", "aze", 25},
	{"Аймара", "", "айм", "aym", 26},
	{"Акан", "", "ака", "aka", 27},
	{"Аккадский", "", "акк", "akk", 28},
	{"Албанский", "", "алб", "alb", 30}, // /sqi
	{"Алгонкинские языки", "", "алг", "alg", 32},
	{"Алеутский", "", "але", "ale", 33},
	{"Алтайские", "другие", "алс", "tut", 34},
	{"Алтайский", "", "алт", "alt", 35},
	{"Амаринья", "Амхарский", "", "", -1},
	{"Амхарский", "Амаринья", "амх", "amh", 40},
	{"Английский", "", "анг", "eng", 45},
	{"Англо-креольские и пиджины", "другие", "акп", "cpe", 46},
	{"Апачские языки", "", "апа", "ара", 48},
	{"Арабский", "", "ара", "ara", 50},
	{"Аравакский", "", "арв", "arw", 51},
	{"Арамейский", "", "арс", "arc", 52},
	{"Арапахо", "", "арп", "arp", 53},
	{"Арауканский", "", "арн", "arn", 54},
	{"Армянский", "", "арм", "arm", 55}, // /hye
	{"Ассамский", "", "аса", "asm", 60},
	{"Ассирийский", "", "асc", "ass", 65},
	{"Атапачские языки", "", "ата", "ath", 67},
	{"Афар", "", "афа", "aar", 68},
	{"Афразийские", "другие", "афз", "afa", 69},
	{"Африкаанс", "", "афр", "afr", 70},
	{"Африхили", "", "афх", "afh", 73},
	{"Ахвахский", "", "ахв", "akh", 74},
	{"Ацтекский", "", "ацт", "nah", 75},
	{"Ачехский", "", "аче", "ace", 76},
	{"Ачоли", "", "ачо", "ach", 77},
	{"Балийский", "", "бал", "ban", 78},
	{"Балтийские", "другие", "бат", "bat", 79},
	{"Бамбара", "", "бам", "bam", 80},
	{"Бамилеке языки", "", "баи", "bai", 81},
	{"Банда", "", "бан", "bad", 82},
	{"Банту", "другие", "бнт", "bnt", 83},
	{"Баса", "", "бас", "bas", 84},
	{"Баскский", "", "бак", "baq", 85}, // /eus
	{"Башкирский", "", "баш", "bak", 86},
	{"Беджа", "бед", "", "bej", 87},
	{"Белорусский", "", "бел", "bel", 90},
	{"Белуджский", "", "беу", "bal", 95},
	{"Бемба", "", "бем", "bem", 97},
	{"Бенгальский", "", "бен", "ben", 100},
	{"Берберские", "другие", "бер", "ber", 102},
	{"Бикольский", "", "бик", "bik", 103},
	{"Бини", "", "бин", "bin", 104},
	{"Бирманский", "", "бир", "bur", 105}, // /mya
	{"Бислама", "", "бис", "bis", 107},
	{"Бихари", "", "бих", "bih", 110},
	{"Болгарский", "", "бол", "bul", 115},
	{"Брауи", "", "бра", "bra", 117},
	{"Бретонский", "", "бре", "bre", 120},
	{"Бугийский", "", "буг", "bug", 123},
	{"Бурятский", "", "бур", "bua", 125},
	{"Бходжпури", "", "бхо", "bho", 126},
	{"Бхотия", "Дзонг-кэ", "", "", -1},
	{"Ваи", "", "ваи", "vai", 127},
	{"Вакашские языки", "", "вак", "wak", 128},
	{"Валлийский", "Уэльский", "вал", "wel", 130}, // cym/
	{"Варай", "", "вар", "war", 131},
	{"Вашо", "", "ваш", "was", 132},
	{"Венгерский", "", "вен", "hun", 133},
	{"Венда", "", "вед", "ven", 134},
	{"Вепсский", "", "веп", "vep", 135},
	{"Вогульский", "Мансийский", "", "", -1},
	{"Воламо", "", "воа", "wal", 136},
	{"Волапюк", "", "вол", "vol", 137},
	{"Волоф", "", "воф", "wol", 138},
	{"Вотяцкий", "Удмуртский", "", "", -1},
	{"Вьетнамский", "", "вье", "vie", 140},
	{"Га", "", "гаа", "gaa", 142},
	{"Гавайский", "", "гав", "haw", 143},
	{"Гагаузский", "", "гаг", "gag", 145},
	{"Гайо", "", "гай", "gay", 146},
	{"Галисийский", "", "гал", "glg", 147},
	{"Ганда", "", "ган", "lug", 148},
	{"Гаэльский", "Гэльский", "", "", -1},
	{"Гереро", "", "гер", "her", 149},
	{"Германские", "другие", "гем", "gem", 150},
	{"Геэз", "", "гез", "gez", 151},
	{"Гильбертский", "", "гил", "gil", 152},
	{"Гиляцкий", "Нивхский", "", "", -1},
	{"Голландский", "Нидерландский", "", "", -1},
	{"Гольдский", "Нанайский", "", "", -1},
	{"Гонди", "", "гон", "gon", 153},
	{"Готский", "", "гот", "got", 154},
	{"Гребо", "", "грб", "grb", 155},
	{"Гренландский", "Эскимосский", "", "", -1},
	{"Греческий", "Новогреческий", "гре", "gre", 157}, // ell/
	{"Грузинский", "", "гру", "geo", 158},             // /kat
	{"Гуарани", "", "гуа", "grn", 160},
	{"Гуджарати", "", "гуд", "guj", 165},
	{"Гэльский", "Гаэльский, Шотландский", "гэл", "gae", 170}, // /gdh
	{"Дакота", "", "дак", "dak", 173},
	{"Даргинский", "", "даг", "dag", 175},
	{"Датский", "", "дат", "dan", 178},
	{"Делаварский", "", "дел", "del", 179},
	{"Дивехи", "Мальдивский", "див", "div", 180},
	{"Динка", "", "дин", "din", 181},
	{"Диула", "Дьюла", "диу", "dyu", 182},
	{"Дзонг-кэ", "", "дзо", "dzo", 183},
	{"Догри", "", "дои", "doi", 184},
	{"Дравидийские", "другие", "дра", "dra", 185},
	{"Древнегреческий", "", "дрг", "grc", 186},
	{"Древнеегипетский", "", "дре", "egy", 187},
	{"Древнерусский", "", "дрр", "rua", 188},
	{"Дуала", "", "дуа", "dua", 190},
	{"Дунганский", "", "дун", "dun", 191},
	{"Еврейско-арабский", "", "еар", "jrb", 192},
	{"Еврейско-персидский", "", "епе", "jpr", 193},
	{"Зенагский", "", "зен", "zen", 194},
	{"Зулу", "", "зул", "zul", 195},
	{"Зуньи", "", "зун", "zun", 196},
	{"Зырянский", "Коми", "", "", -1},
	{"Ибанский", "", "иба", "iba", 197},
	{"Иврит", "", "ивр", "heb", 198},
	{"Игбо", "", "ибо", "ibo", 199},
	{"Иджо", "", "идж", "ijo", 200},
	{"Идиш", "", "иди", "yid", 202},
	{"Илоко", "", "ило", "ilo", 203},
	{"Ингушский", "", "инг", "ing", 205},
	{"Индийские", "другие", "ини", "inc", 207},
	{"Индоевропейские", "другие", "ино", "ine", 208},
	{"Индонезийский", "", "инд", "ind", 210},
	{"Интерлингва", "", "ина", "ina", 215},
	{"Интерлингве", "", "ине", "ile", 216},
	{"Инуктитут", "", "инк", "iku", 217},
	{"Инупиак", "", "инп", "ipk", 218},
	{"Иранские", "другие", "ира", "ira", 219},
	{"Ирландский", "", "ирл", "iri", 220}, // gai/
	{"Ирокезские языки", "", "иро", "iro", 222},
	{"(иси) 3улу", "Зулу", "", "", -1},
	{"(иси) Коса", "Коса", "", "", -1},
	{"Искусственные", "другие", "иск", "art", 223},
	{"Исландский", "", "исл", "isl", 225}, // ice/
	{"Испанский", "", "исп", "spa", 230},  // esl/
	{"Итальянский", "", "ита", "ita", 235},
	{"Ительменский", "", "ите", "ite", 240},
	{"Йоруба", "", "йор", "yor", 245},
	{"Кабардино-черкесский", "", "каа", "kad", 250},
	{"Кабильский", "", "каб", "kab", 251},
	{"Кави", "", "каг", "kaw", 252},
	{"Кавказские", "другие", "кав", "cau", 253},
	{"Каддо", "", "кад", "cad", 254},
	{"Казахский", "", "каз", "kaz", 255},
	{"Калмыцкий", "", "кал", "kal", 260},
	{"Камба", "", "кам", "kam", 263},
	{"Каннада", "", "кан", "kan", 265},
	{"Канури", "", "кау", "kau", 267},
	{"Караимский", "", "каи", "kai", 270},
	{"Каракалпакский", "", "кап", "kaa", 275},
	{"Карачаево-балкарский", "", "као", "kah", 280},
	{"Карельский", "", "кас", "kae", 285},
	{"Каренский", "", "кае", "kar", 287},
	{"Кариб", "", "кар", "car", 288},
	{"Каталанский", "", "кат", "cat", 290},
	{"Качинский", "", "кач", "kac", 293},
	{"Кашмири", "", "каш", "kas", 294},
	{"Кельтские", "другие", "кел", "сel", 295},
	{"Кечуа", "", "кеч", "que", 300},
	{"Кикуйю", "", "кик", "kik", 302},
	{"Киньяма", "", "кия", "kua", 303},
	{"Киньяруанда", "", "кин", "kin", 304},
	{"Киргизский", "Кыргызский", "кир", "kyr", 305}, // /кыр
	{"(ки) Рунди", "Рунди", "", "", -1},
	{"Китайский", "", "кит", "chi", 315}, // /zho
	{"Койсанские", "другие", "кой", "khi", 317},
	{"Коми", "", "кои", "kom", 320},
	{"Коми-пермяцкий", "", "ком", "pem", 325},
	{"Конго", "", "кон", "kon", 326},
	{"Конкани", "", "кок", "kok", 327},
	{"Коптский", "", "коп", "cop", 328},
	{"Корейский", "", "коо", "kor", 330},
	{"Корнский", "", "кор", "cor", 332},
	{"Корсиканский", "", "кос", "cos", 334},
	{"Корякский", "", "коя", "koy", 335},
	{"Коса", "", "коа", "xho", 340},
	{"Кпелле", "", "кпе", "kpe", 341},
	{"Креольские и пиджины", "другие", "крп", "crp", 342},
	{"Кри", "", "кри", "сrе", 343},
	{"Крик", "", "крк", "mus", 344},
	{"Кру", "", "кру", "kro", 345},
	{"Крымско-татарский", "", "кры", "cri", 347},
	{"Кумыкский", "", "кум", "kum", 349},
	{"Курдский", "", "кур", "kur", 350},
	{"Курух", "", "куу", "kru", 352},
	{"Кусайе", "", "кус", "kus", 353},
	{"Кутенаи", "", "кут", "kut", 354},
	{"Кушитские", "другие", "куш", "cus", 355},
	{"Кхаси", "", "кха", "kha", 357},
	{"Кхмерский", "", "кхм", "khm", 360},
	{"Кыргизский", "Киргизский", "", "", -1},
	{"Ладино", "", "лад", "lad", 363},
	{"Лакский", "", "лак", "lak", 370},
	{"Ламба", "", "лам", "lam", 373},
	{"Ламутский", "Эвенский", "", "", -1},
	{"Лангедок", "Окситанский", "", "", -1},
	{"Лаосский", "", "лао", "lao", 375},
	{"Латинский", "", "лат", "lat", 380},
	{"Латышский", "", "лаш", "lav", 385},
	{"Лахнда", "", "лах", "lah", 387},
	{"Лезгинский", "", "лез", "lez", 390},
	{"Лингала", "", "лин", "lin", 395},
	{"Литовский", "", "лит", "lit", 400},
	{"Лози", "", "лоз", "loz", 402},
	{"(ло) Монго", "Монго", "", "", -1},
	{"Луба-Катанга", "", "луб", "lub", 404},
	{"Лужицкие языки", "", "луж", "wen", 405},
	{"Луисеньо", "", "луи", "lui", 406},
	{"Лунда", "", "лун", "lun", 407},
	{"Луо", "Кения и Танзания", "луо", "luo", 408},
	{"Люксембургский", "", "люк", "Itz", 409},
	{"Магахи", "", "маг", "mag", 410},
	{"Мадурский", "", "мад", "mad", 411},
	{"Майтхили", "", "май", "mai", 412},
	{"Майя языки", "", "мая", "myn", 413},
	{"Макассарский", "", "мак", "mak", 414},
	{"Македонский", "", "маа", "mac", 415}, // /mke
	{"Малагасийский", "", "млг", "mlg", 418},
	{"Малайский", "", "маз", "may", 420}, // /msa
	{"Малаялам", "", "мал", "mal", 425},
	{"Мальдивский", "Дивехи", "", "", -1},
	{"Мальтийский", "", "млт", "mlt", 430},
	{"Мандинго", "", "маи", "man", 432},
	{"Манипурский", "", "мни", "mni", 433},
	{"Манобо языки", "", "мно", "mno", 434},
	{"Мансийский", "Вогульский", "ман", "vog", 435},
	{"Маори", "", "мао", "mao", 437}, // /mri
	{"Маратхи", "", "мар", "mar", 440},
	{"Марвари", "", "мвр", "mwr", 443},
	{"Марийский", "Черемисский", "мач", "chm", 445},
	{"Маршальский", "", "маш", "mah", 446},
	{"Масаи", "", "маc", "mas", 447},
	{"Менде", "", "мен", "men", 451},
	{"Микмак", "", "мик", "mic", 452},
	{"Минангкабау", "", "мин", "min", 453},
	{"Мокшанский", "Мокша-мордовский", "мок", "mok", 455},
	{"Молдавский", "", "мол", "mol", 460},
	{"Монго", "", "мог", "lol", 462},
	{"Монгольский", "", "мон", "mon", 463},
	{"Монкхмерские", "другие", "мкх", "mkh", 465},
	//{"Мордовские", "Мокшанский/Эрзянский", "", -1},
	{"Моси", "", "мос", "mos", 466},
	{"Мохаук", "", "мох", "moh", 467},
	{"Мунда языки", "", "мун", "mun", 468},
	{"Мэнкский", "", "мэн", "max", 469},
	{"Навахо", "", "нав", "nav", 470},
	{"Нанайский", "Гольдский", "нан", "gol", 471},
	{"Науру", "", "нау", "nau", 472},
	{"Ндебеле северный", "", "нде", "nde", 473},
	{"Ндебеле южный", "", "нбл", "nbl", 474},
	{"Ндунга", "", "нду", "ndo", 475},
	{"Неварский", "", "нев", "new", 478},
	{"Неидентифицированный", "", "унд", "und", 480},
	{"Немецкий", "", "нем", "ger", 481}, // deu/
	{"Ненецкий", "Юрако-Самоедский", "нен", "yur", 482},
	{"Непальский", "", "неп", "nep", 485},
	{"Нзима", "", "нзи", "nzi", 487},
	{"Нивхский", "Гиляцкий", "нив", "giy", 490},
	{"Нигер-кордофанские", "другие", "ник", "nic", 493},
	{"Нидерландский", "Голландский", "нид", "dut/ndl", 495},
	{"Нидерландский", "средневековый", "нис", "dum", 496},
	{"Нило-сахарские", "другие", "них", "ssa", 497},
	{"Ниуэ", "", "ниу", "niu", 498},
	{"Новогреческий", "Греческий", "", "", -1},
	{"Новонорвежский", "Нюнорск", "", "", -1},
	{"Ногайский", "", "ног", "nog", 505},
	{"Норвежский", "", "нор", "nor", 506},
	{"Нубийские языки", "", "нуб", "nub", 507},
	{"Ньоро", "", "ньо", "nyo", 508},
	{"Ньямвези", "", "ням", "nym", 509},
	{"Ньянджа", "", "нян", "nya", 510},
	{"Ньянколе", "", "нья", "nyn", 512},
	{"Нюнорск", "Новонорвежский", "нно", "nno", 513},
	{"Оджибва", "", "одж", "oji", 515},
	{"Окситанский", "", "окс", "oci", 517},
	{"Ория", "", "ори", "ori", 520},
	{"Оромо", "", "орм", "orm", 522},
	{"Оседжи", "", "осе", "osa", 523},
	{"Осетинский", "", "ост", "oss", 524},
	{"Остяцкий", "Хантыйский", "", "", -1},
	{"Отомангские языки", "", "ото", "oto", 525},
	{"Палay", "", "пал", "pau", 526},
	{"Пали", "", "пли", "pli", 527},
	{"Пампанга", "", "пам", "pam", 528},
	{"Пангасинан", "", "паг", "pag", 529},
	{"Панджаби", "", "пан", "pan", 530},
	{"Папуасско-австралийские", "другие", "паа", "paa", 532},
	{"Папьяменто", "", "пап", "pap", 533},
	{"Персидский", "", "пер", "per", 535}, // fas/
	{"Пехлевийский", "", "пех", "pal", 537},
	{"Польский", "", "пол", "pol", 540},
	{"Понапе", "", "пон", "pon", 542},
	{"Португалокреольские и пиджины", "другие", "пкп", "срр", 543},
	{"Португальский", "", "пор", "рог", 545},
	{"Пракриты языки", "", "пра", "pra", 547},
	{"Пушту", "", "пуш", "pus", 550},
	{"Раджастхани", "", "рад", "raj", 555},
	{"Разных семей языки", "", "мул", "mul", 556},
	{"Раротонга", "", "рар", "rar", 557},
	{"Ретороманский", "", "peт", "roh", 560},
	{"Романские", "другие", "роа", "roa", 563},
	{"Румынский", "", "рум", "rum", 565}, // ron/
	{"Рунди", "", "рун", "run", 567},
	{"Русский", "", "рус", "rus", 570},
	{"Саамские языки", "", "саа", "smi", 575},
	{"Салишские языки", "", "сал", "sal", 576},
	{"Самаритянский арамейский", "", "сам", "sam", 577},
	{"Самоанский", "", "смо", "smo", 578},
	{"Санго", "", "саг", "sag", 579},
	{"Сандаве", "", "сад", "sad", 580},
	{"Санскрит", "", "сан", "san", 581},
	{"Сапотекский", "", "сап", "zap", 582},
	{"Сардинский", "", "срд", "srd", 583},
	{"Свази", "", "сва", "ssw", 584},
	{"Себуано", "", "себ", "ceb", 587},
	{"Северной Америки индейцев", "другие", "саи", "nai", 588},
	{"Селькупский", "", "сел", "sel", 590},
	{"Семитские", "другие", "сем", "sem", 593},
	{"Сербскохорватский", "", "скр", "scr", 595},
	{"Серер", "", "срр", "srr", 596},
	{"(се) Тсвана", "", "Тсвана", "", -1},
	{"Сидама", "", "сид", "sid", 597},
	{"Сиксика", "", "сик", "bla", 598},
	{"Сингальский", "", "син", "sin", 599},
	{"Синдхи", "", "снд", "snd", 600},
	{"Синотибетские", "другие", "сит", "sit", 601},
	{"Сирийский", "", "сир", "syr", 602},
	{"Сиу языки", "", "сиу", "sio", 603},
	{"Славянские", "другие", "сла", "sla", 604},
	{"Словацкий", "", "сло", "slk", 605}, // /slo
	{"Словенский", "", "слв", "slv", 610},
	{"Смешанные", "другие", "сме", "mis", 612},
	{"Согдийский", "", "сог", "sog", 613},
	{"Сомали", "", "сом", "som", 615},
	{"Сонгаи", "", "сон", "son", 616},
	{"Сото Северный", "", "соc", "nso", 617},
	{"Сото Южный", "", "сот", "sot", 618},
	{"Среднеанглийский", "", "сра", "enm", 619},
	{"Средневерхненемецкий", "", "срн", "gmh", 620},
	{"Среднеирландский", "", "сеи", "mga", 621},
	{"Среднефранцузский", "", "срф", "frm", 622},
	{"Староанглийский", "", "ста", "ang", 623},
	{"Староверхненемецкий", "", "свн", "goh", 624},
	{"Староирландский", "", "сти", "sga", 625},
	{"Старонорвежский", "", "стн", "non", 626},
	{"Староперсидский", "", "стп", "peo", 627},
	{"Старопровансальский", "", "спр", "pro", 628},
	{"Старосеверный", "Старонорвежский", "", "", -1},
	{"Старославянский", "Церковно-славянский", "", "", -1},
	{"Старотурецкий", "", "стт", "ota", 629},
	{"Старофранцузский", "", "стф", "fro", 630},
	{"Суахили", "", "суа", "swa", 631},
	{"Сукума", "", "сук", "suk", 632},
	{"Сунданский", "", "сун", "sun", 633},
	{"Сусу", "", "сус", "sus", 634},
	{"Табасаранский", "", "таб", "tab", 635},
	{"Тагалог", "", "таг", "tgl", 636},
	{"Таджикский", "", "тад", "tgk", 640},
	{"Таи", "", "таи", "tha", 645},
	{"Таитянский", "", "тая", "tah", 647},
	{"Талышский", "", "тал", "tal", 650},
	{"Тамашек", "", "тмш", "tmh", 653},
	{"Тамильский", "", "там", "tam", 655},
	{"Татарский", "", "тар", "tat", 660},
	{"Татский", "", "тат", "tai", 665},
	{"Тви", "", "тви", "twi", 670},
	{"Телугу", "", "тел", "tel", 675},
	{"Темне", "", "тем", "tem", 677},
	{"Терено", "", "тер", "ter", 678},
	{"Тибетский", "", "тиб", "tib", 680}, // bod/
	{"Тиви", "", "тив", "tiv", 681},
	{"Тигре", "", "тиг", "tig", 682},
	{"Тигринья", "", "тир", "tir", 683},
	{"Тлингит", "", "тли", "tli", 684},
	{"Тонга", "Ньяса", "тог", "tog", 685},
	{"Тонга", "Тонга Исландский", "тон", "ton", 686},
	{"Трук", "", "тру", "tru", 687},
	{"Тсвана", "", "тсн", "tsn", 688},
	{"Тсонга", "", "тсо", "tso", 689},
	{"Тувинский", "", "тув", "tyv", 690},
	{"Тумбука", "", "тум", "tum", 692},
	{"Турецкий", "", "тур", "tur", 693},
	{"Туркменский ", "", "тук", "tuk", 695},
	{"Угаритский", "", "уга", "uga", 697},
	{"Удмуртский", "Вотяцкий", "удм", "vot", 700},
	{"Удэгейский", "", "удэ", "ude", 705},
	{"Узбекский", "", "узб", "uzb", 710},
	{"Уйгурский", "", "уйг", "uig", 715},
	{"Украинский", "", "укр", "ukr", 720},
	{"Ульчский", "", "уль", "ulc", 725},
	{"Умбунду", "", "умб", "umb", 727},
	{"Урду", "", "урд", "urd", 730},
	{"Уэльский", "Валлийский", "", "", -1},
	{"Фанг", "", "фан", "fan", 732},
	{"Фанти", "", "фат", "fat", 733},
	{"Фарерский", "", "фар", "fao", 735},
	{"Фиджи", "", "фид", "fij", 737},
	{"Финикийский", "", "фик", "phn", 738},
	{"Финно-угорские", "другие", "фиу", "fiu", 742},
	{"Финский", "", "фин", "fin", 740},
	{"Фон", "", "фон", "fon", 743},
	{"Франко-креольские и пиджины", "другие", "фкп", "cpf", 744},
	{"Французский", "", "фра", "fra", 745}, // /fre
	{"Фризский", "", "фри", "fry", 750},
	{"Фулах", "", "фул", "ful", 752},
	{"Хайда", "", "хай", "hai", 753},
	{"Хакасский", "", "хак", "khk", 755},
	{"Хантыйский", "Остяцкий", "хан", "ost", 760},
	{"Хауса", "", "хау", "hau", 761},
	{"Хилигайнон", "", "хил", "hil", 762},
	{"Химачали", "", "хим", "him", 763},
	{"Хинди", "", "хин", "hin", 770},
	{"Хиримоту", "", "хмо", "hmo", 772},
	{"Хотанский", "", "хот", "kho", 773},
	{"Хупа", "", "хуп", "hup", 774},
	{"Цахурский", "", "цах", "tsa", 775},
	{"Центральной Америки индейцев", "другие", "цаи", "cai", 776},
	{"Церковно-славянский", "", "цер", "chu", 777},
	{"Цимшиан", "", "цим", "tsi", 778},
	{"Цыганский", "", "цыг", "rom", 780},
	{"Чагатайский", "", "чаг", "chg", 781},
	{"Чаморро", "", "чам", "cha", 782},
	{"Чейенн", "", "чей", "chy", 783},
	{"Черемисский", "Марийский", "", "", -1},
	{"Чероки", "", "чер", "chr", 784},
	{"Чеченский", "", "чеч", "che", 785},
	{"Чешский", "", "чеш", "cze", 790}, // ces/
	{"Чжуань", "", "чжу", "zha", 791},
	{"(чи) Ньянджа", "Ньянджа", "", "", -1},
	{"(чи) Яо", "Яо", "", "", -1},
	{"Чибча", "", "чиб", "chb", 792},
	{"Чинук жаргон", "", "чин", "chn", 793},
	{"Чоктав", "", "чок", "cho", 794},
	{"Чувашский", "", "чув", "сhv", 795},
	{"Чукотский", "", "чук", "chk", 800},
	{"Шанский", "", "шан", "shn", 803},
	{"Шведский", "", "шве", "swe", 805}, // sve/
	{"Шона", "", "шон", "sna", 807},
	{"Шорский", "", "шор", "sho", 810},
	{"Шотландский", "Гэльский", "", "", -1},
	{"Шугнанский", "", "шуг", "shu", 815},
	{"Шумерский", "", "шум", "sux", 817},
	{"Эве", "", "эве", "ewe", 820},
	{"Эвенкийский", "Тунгусский", "эвк", "tum", 825},
	{"Эвенский", "", "эвн", "lau", 830},
	{"Эвондо", "", "эво", "ewo", 832},
	{"Экаджук", "", "эка", "eka", 833},
	{"Эламский", "", "эла", "elx", 834},
	{"Эрзянский", "", "эрз", "erz", 835},
	{"Эскимосские", "другие", "эск", "esk", 840},
	{"Эскимосский", "", "эсм", "kal", 843},
	{"Эсперанто", "", "эсп", "еро", 845},
	{"Эстонский", "", "эст", "est", 850},
	{"Эфик", "", "эфи", "efi", 852},
	{"Южной Америки индейцев", "другие", "юаи", "sai", 853},
	{"Юкагирский", "", "юка", "yuk", 855},
	{"Юрако-Самоедский", "Ненецкий", "", "", -1},
	{"Яванский", "", "ява", "jav", 860}, // /jaw
	{"Якутский", "", "яку", "sah", 865},
	{"Яо", "", "яоа", "yao", 867},
	{"Яп", "", "япа", "yap", 868},
	{"Японский", "", "япо", "jpn", 870},
}

/*
Абазинский аба aba 05
Абхазский абх abk 10
Авадхи авд awa 12
Аварский ава ava 14
Авестийский аве ave 16
Австронезийские (другие) авс map 17
Адангме ада ada 18
Адыгейский ады ady 20
Азербайджанский азе aze 25
Аймара айм aym 26
Акан ака aka 27
Аккадский акк akk 28
Албанский алб alb/sqi 30
Алгонкинские языки алг alg 32
Алеутский але ale 33
Алтайские (другие) алс tut 34
Алтайский алт alt 35
Амаринья см. Амхарский
Амхарский (Амаринья) амх amh 40
Английский анг eng 45
Англо-креольские и пиджины (другие) акп cpe 46
Апачские языки апа ара 48
Арабский ара ara 50
Аравакский арв arw 51
Арамейский арс arc 52
Арапахо арп arp 53
Арауканский арн arn 54
Армянский арм arm/hye 55
Ассамский аса asm 60
Ассирийский асc ass 65
Атапачские языки ата ath 67
Афар афа aar 68
Афразийские (другие) афз afa 69
Африкаанс афр afr 70
Африхили афх afh 73
Ахвахский ахв akh 74
Ацтекский ацт nah 75
Ачехский аче ace 76
Ачоли ачо ach 77
Балийский бал ban 78
 Балтийские (другие) бат bat 79
Бамбара бам bam 80
Бамилеке языки баи bai 81
Банда бан bad 82
Банту (другие) бнт bnt 83
Баса бас bas 84
Баскский бак baq/eus 85
Башкирский баш bak 86
Беджа бед bej 87
Белорусский бел bel 90
Белуджский беу bal 95
Бемба бем bem 97
Бенгальский бен ben 100
Берберские (другие) бер ber 102
Бикольский бик bik 103
Бини бин bin 104
Бирманский бир bur/mya 105
Бислама бис bis 107
Бихари бих bih 110
Болгарский бол bul 115
Брауи бра bra 117
Бретонский бре bre 120
Бугийский буг bug 123
Бурятский бур bua 125
Бходжпури бхо bho 126
Бхотия см. Дзонг-кэ Ваи ваи vai 127
Вакашские языки вак wak 128
Валлийский (Уэльский) вал cym/wel 130
Варай вар war 131
Вашо ваш was 132
Венгерский вен hun 133
Венда вед ven 134
Вепсский веп vep 135
Вогульский см. Мансийский
Воламо воа wal 136
Волапюк вол vol 137
Волоф воф wol 138
Вотяцкий см. Удмуртский
Вьетнамский вье vie 140
Га гаа gaa 142
Гавайский гав haw 143
Гагаузский гаг gag 145
Гайо гай gay 146
Галисийский гал glg 147
Ганда ган lug 148
Гаэльский см. Гэльский и Шотландский
Гереро гер her 149
Германские (другие) гем gem 150
Геэз гез gez 151
Гильбертский гил gil 152
Гиляцкий см. Нивхский
Голландский см. Нидерландский
Гольдский см. Нанайский
Гонди гон gon 153
Готский гот got 154
Гребо грб grb 155
Гренландский см. Эскимосский
Греческий (новогреческий) гре ell/gre 157
Грузинский гру geo/kat 158
Гуарани гуа grn 160
Гуджарати гуд guj 165
Гэльский (Гаэльский, Шотландский) гэл gae/gdh 170
Дакота дак dak 173
Даргинский даг dag 175
Датский дат dan 178
Делаварский дел del 179
Дивехи (Мальдивский) див div 180
Динка дин din 181
Диула (Дьюла) диу dyu 182
Дзонг-кэ дзо dzo 183
Догри дои doi 184
Дравидийские (другие) дра dra 185
Древнегреческий дрг grc 186
Древнеегипетский дре egy 187
Древнерусский дрр rua 188
Дуала дуа dua 190
Дунганский дун dun 191
Еврейско-арабский еар jrb 192
Еврейско- персидский епе jpr 193
Зенагский зен zen 194
Зулу зул zul 195
Зуньи зун zun 196
Зырянский см. Коми
Ибанский иба iba 197
Иврит ивр heb 198
Игбо ибо ibo 199
Иджо идж ijo 200
Идиш иди yid 202
Илоко ило ilo 203
Ингушский инг ing 205
Индийские (другие) ини inc 207
Индоевропейские (другие) ино ine 208
Индонезийский инд ind 210
Интерлингва ина ina 215
Интерлингве ине ile 216
Инуктитут инк iku 217
Инупиак инп ipk 218
Иранские (другие) ира ira 219
Ирландский ирл gai/iri 220
Ирокезские языки иро iro 222
(иси) 3улу см. Зулу
(иси) Коса см. Коса
Искусственные (другие) иск art 223
Исландский исл ice/isl 225
Испанский исп esl/spa 230
Итальянский ита ita 235
Ительменский ите ite 240
Йоруба йор yor 245
Кабардино-черкесский каа kad 250
Кабильский каб kab 251
Кави каг kaw 252
Кавказские (другие) кав cau 253
Каддо кад cad 254
Казахский каз kaz 255
Калмыцкий кал kal 260
Камба кам kam 263
Каннада кан kan 265
Канури кау kau 267
Караимский каи kai 270
Каракалпакский кап kaa 275
Карачаево-балкарский као kah 280
Карельский кас kae 285
Каренский кае kar 287
Кариб кар car 288
Каталанский кат cat 290
Качинский кач kac 293
Кашмири каш kas 294
Кельтские (другие) кел сel 295
Кечуа кеч que 300
Кикуйю кик kik 302
Киньяма кия kua 303
Киньяруанда кин kin 304
Киргизский (Кыргызский)   кир/кыр  kyr 305
(ки) Рунди см. Рунди
Китайский кит chi/zho 315
Койсанские (другие) кой khi 317
Коми кои kom 320
Коми-пермяцкий ком pem 325
Конго кон kon 326
Конкани кок kok 327
Коптский коп cop 328
Корейский коо kor 330
Корнский кор cor 332
Корсиканский кос cos 334
Корякский коя koy 335
Коса коа xho 340
Кпелле кпе kpe 341
Креольские и пиджины (другие) крп crp 342
Кри кри сrе 343
Крик крк mus 344
Кру кру kro 345
Крымско-татарский кры cri 347
Кумыкский кум kum 349
Курдский кур kur 350
Курух куу kru 352
Кусайе кус kus 353
Кутенаи кут kut 354
Кушитские (другие) куш cus 355
Кхаси кха kha 357
Кхмерский кхм khm 360
Кыргизский, см Киргизский
Ладино лад lad 363
Лакский лак lak 370
Ламба лам lam 373
Ламутский см. Эвенский
Лангедок см. Окситанский
Лаосский лао lao 375
Латинский лат lat 380
Латышский лаш lav 385
Лахнда лах lah 387
Лезгинский лез lez 390
Лингала лин lin 395
Литовский лит lit 400
Лози лоз loz 402
(ло) Монго см. Монго
Луба-Катанга луб lub  404
Лужицкие языки луж wen 405
Луисеньо луи lui 406
Лунда лун lun 407
Луо (Кения и Танзания) луо luo 408
Люксембургский люк Itz 409
Магахи маг mag 410
Мадурский мад mad 411
Майтхили май mai 412
Майя языки мая myn 413
Макассарский мак mak 414
Македонский маа mac/mke 415
Малагасийский млг mlg 418
Малайский маз may/msa 420
Малаялам мал mal 425
Мальдивский см. Дивехи
Мальтийский млт mlt 430
Мандинго маи man 432
Манипурский мни mni 433
Манобо языки мно mno 434
Мансийский (Вогульский) ман vog 435
Маори мао mao/mri 437
Маратхи мар mar 440
Марвари мвр mwr 443
Марийский (Черемисский) мач chm 445
Маршальский маш mah 446
Масаи маc mas 447
Менде мен men 451
Микмак мик mic 452
Минангкабау мин min 453
Мокшанский (Мокша-мордовский) мок mok 455
Молдавский мол mol 460
Монго мог lol 462
Монгольский мон mon 463
Монкхмерские (другие) мкх mkh 465
Мордовские см. Мокшанский и Эрзянский
Моси мос mos 466
Мохаук мох moh 467
Мунда языки мун mun 468
Мэнкский мэн max 469
Навахо нав nav 470
Нанайский (Гольдский) нан gol 471
Науру нау nau 472
Ндебеле северный нде nde 473
Ндебеле южный нбл nbl 474
Ндунга нду ndo 475
Неварский нев new 478
Неидентифицированный унд und 480
Немецкий нем deu/ger 481
Ненецкий (Юрако-Самоедский) нен yur 482
Непальский неп nep 485
Нзима нзи nzi 487
Нивхский (Гиляцкий) нив giy 490
Нигер-кордофанские (другие) ник nic 493
Нидерландский (Голландский) нид dut/ndl 495
Нидерландский средневековый нис dum 496
Нило-сахарские (другие) них ssa 497
Ниуэ ниу niu 498
Новогреческий см. Греческий
Новонорвежский см. Нюнорск
Ногайский ног nog 505
Норвежский нор nor 506
Нубийские языки нуб nub 507
Ньоро ньо nyo 508
Ньямвези ням nym 509
Ньянджа нян nya 510
Ньянколе нья nyn 512
Нюнорск (Новонорвежский) нно nno 513
Оджибва одж oji 515
Окситанский окс oci 517
Ория ори ori 520
Оромо орм orm 522
Оседжи осе osa 523
Осетинский ост oss 524
Остяцкий см. Хантыйский
Отомангские языки ото oto 525
Палay пал pau 526
Пали пли pli 527
Пампанга пам pam 528
Пангасинан паг pag 529
Панджаби пан pan 530
Папуасско-австралийские (другие) паа paa 532
Папьяменто пап pap 533
Персидский пер fas/per 535
Пехлевийский пех pal 537
Польский пол pol 540
Понапе пон pon 542
Португалокреольские и пиджины (другие) пкп срр 543
Португальский пор рог 545
Пракриты языки пра pra 547
Пушту пуш pus 550
Раджастхани рад raj 555
Разных семей языки мул mul 556
Раротонга рар rar 557
Ретороманский peт roh 560
Романские (другие) роа roa 563
Румынский рум ron/rum 565
Рунди рун run 567
Русский рус rus 570
Саамские языки саа smi 575
Салишские языки сал sal 576
Самаритянский арамейский сам sam 577
Самоанский смо smo 578
Санго саг sag 579
Сандаве сад sad 580
Санскрит сан san 581
Сапотекский сап zap 582
Сардинский срд srd 583
Свази сва ssw 584
Себуано себ ceb 587
Северной Америки индейцев (другие) саи nai 588
Селькупский сел sel 590
Семитские (другие) сем sem 593
Сербскохорватский скр scr 595
Серер срр srr 596
(се) Тсвана см. Тсвана
Сидама сид sid 597
Сиксика сик bla 598
Сингальский син sin 599
Синдхи снд snd 600
Синотибетские (другие) сит sit 601
Сирийский сир syr 602
Сиу языки сиу sio 603
Славянские (другие) сла sla 604
Словацкий сло slk/slo 605
Словенский слв slv 610
Смешанные (другие) сме mis 612
Согдийский сог sog 613
Сомали сом som 615
Сонгаи сон son 616
Сото Северный соc nso 617
Сото Южный сот sot 618
Среднеанглийский сра enm 619
Средневерхненемецкий срн gmh 620
Среднеирландский сеи mga 621
Среднефранцузский срф frm 622
Староанглийский ста ang 623
Староверхненемецкий свн goh 624
Староирландский сти sga 625
Старонорвежский стн non 626
Староперсидский стп peo 627
Старопровансальский спр pro 628
Старосеверный см. Старонорвежский
Старославянский см. Церковно-славянский
Старотурецкий стт ota 629
Старофранцузский стф fro 630
Суахили суа swa 631
Сукума сук suk 632
Сунданский сун sun 633
Сусу сус sus 634
Табасаранский таб tab 635
Тагалог таг tgl 636
Таджикский тад tgk 640
Таи таи tha 645
Таитянский тая tah 647
Талышский тал tal 650
Тамашек тмш tmh 653
Тамильский там tam 655
Татарский тар tat 660
Татский тат tai 665
Тви тви twi 670
Телугу тел tel 675
Темне тем tem 677
Терено тер ter 678
Тибетский тиб bod/tib 680
Тиви тив tiv 681
Тигре тиг tig 682
Тигринья тир tir 683
Тлингит тли tli 684
Тонга (Ньяса) тог tog 685
Тонга (Тонга Исландский) тон ton 686
Трук тру tru 687
Тсвана тсн tsn 688
Тсонга тсо tso 689
Тувинский тув tyv 690
Тумбука тум tum 692
Турецкий тур tur 693
Туркменский  тук tuk 695
Угаритский уга uga 697
Удмуртский (Вотяцкий) удм vot 700
Удэгейский удэ ude 705
Узбекский узб uzb 710
Уйгурский уйг uig 715
Украинский укр ukr 720
Ульчский уль ulc 725
Умбунду умб umb 727
Урду урд urd 730
Уэльский см. Валлийский
Фанг фан fan 732
Фанти фат fat 733
Фарерский фар fao 735
Фиджи фид fij 737
Финикийский фик phn 738
Финно-угорские (другие) фиу fiu 742
Финский фин fin 740
Фон фон fon 743
Франко-креольские и пиджины (другие) фкп cpf 744
Французский фра fra/fre 745
Фризский фри fry 750
Фулах фул ful 752
Хайда хай hai 753
Хакасский хак khk 755
Хантыйский (Остяцкий) хан ost 760
Хауса хау hau 761
Хилигайнон хил hil 762
Химачали хим him 763
Хинди хин hin 770
Хиримоту хмо hmo 772
Хотанский хот kho 773
Хупа хуп hup 774
Цахурский цах tsa 775
Центральной Америки индейцев (другие) цаи cai 776
Церковно-славянский цер chu 777
Цимшиан цим tsi 778
Цыганский цыг rom 780
Чагатайский чаг chg 781
Чаморро чам cha 782
Чейенн чей chy 783
Черемисский см. Марийский
Чероки чер chr 784
Чеченский чеч che 785
Чешский чеш ces/cze 790
Чжуань чжу zha 791
(чи) Ньянджа см. Ньянджа
(чи) Яо см. Яо
Чибча чиб chb 792
Чинук жаргон чин chn 793
Чоктав чок cho 794
Чувашский чув сhv 795
Чукотский чук chk 800
Шанский шан shn 803
Шведский шве sve/swe 805
Шона шон sna 807
Шорский шор sho 810
Шотландский см. Гэльский
Шугнанский шуг shu 815
Шумерский шум sux 817
Эве эве ewe 820
Эвенкийский (Тунгусский) эвк tum 825
Эвенский эвн lau 830
Эвондо эво ewo 832
Экаджук эка eka 833
Эламский эла elx 834
Эрзянский эрз erz 835
Эскимосские (другие) эск esk 840
Эскимосский эсм kal 843
Эсперанто эсп еро 845
Эстонский эст est 850
Эфик эфи efi 852
Южной Америки индейцев (другие) юаи sai 853
Юкагирский юка yuk 855
Юрако-Самоедский см. Ненецкий
Яванский ява jav/jaw 860
Якутский яку sah 865
Яо яоа yao 867
Яп япа yap 868
Японский япо jpn 870
*/
